//  Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Решение 1: 

// Console.WriteLine("Введите цифру, обозначающую день недели: ");
// int daynumber = Convert.ToInt32(Console.ReadLine());
// if(daynumber == 6 || daynumber == 7)
// {
//     Console.WriteLine($"{daynumber} -> да");
// }
// else if(daynumber < 1 || daynumber > 7)
// {
//     Console.WriteLine($"{daynumber} -> такого дня нет, повторите ввод");
// }
// else
// {
//     Console.WriteLine($"{daynumber} -> нет");
// }

// Решение 2 :

